/*(дополнительная)  Текстовый файл mark.txt содержит оценки учащихся класса за год в формате : Фамилия, оценки по 10 предметам, например:
Иванов 5 8 6 4 9 7 6 8 9 10
Петров 10 4 9 6 7 8 9 9 9 7
Сидоров 1 2 3 4 5 6 7 8 9 10 и т.д.
Файл Subjects.txt содержит названия предметов в том порядке, в котором перечислены оценки, например:
1. Русский язык
2. Русская литература
3. Математика
4. Физика и.т.д до 10 предметов
Необходимо:
вывести на экран фамилии отличников;
определить среднюю оценку класса по каждому предмету;
сформировать новый файл и записать туда фамилии учеников и их средний бал за год, расположив фамилии по убыванию среднего балла.*/

#include<iostream>
#include<fstream>

using namespace std;

int main()
{


	system("pause");
	return 0;
}