/*(дополнительная). На диске в определенной папке записано некоторое
количество текстовых файлов (student1.txt, student2.txt, student3.txt,…),
содержащих результат решения задачи на матрицы
в следующем формате:
Формат файла	

1-я строка: Фамилия студента
2-я строка: два целых числа, определяющие
размер матрицы и разделенные пробелом
3-я и следующие строки: элементы матрицы,
записанные построчно и разделенные между
собой пробелом.

Пример
Иванов
3 4
3 -5  6  8
2  0  8 -1
10 3 11 5

Файл output.txt содержит правильный (эталонный) результат решения задачи
в таком же формате, но без указания фамилии студента. Необходимо написать
программу, которая сформирует текстовый файл results.txt, содержащий фамилии
студентов, которые предоставили верное решение задачи.
*/

#include<iostream>
#include<fstream>

using namespace std;

int main()
{


	system("pause");
	return 0;
}